In [1]:
%matplotlib inline
%load_ext autoreload
%autoreload 2

In [2]:
import os
import sys
import pandas as pd
import numpy as np

In [3]:
import initdirs

from pdata import pdutils

Example from https://chrisalbon.com/python/data_wrangling/pandas_dataframe_examples/

In [4]:
people_data = {
    'first_name': ['Jason', 'Molly', 'Tina', 'Jake', 'Amy'], 
    'last_name': ['Miller', 'Jacobson', 'Ali', 'Milner', 'Cooze'], 
    'age': [42, 52, 36, 24, 73]
}

df_people = pd.DataFrame(people_data)

df_people

  first_name last_name  age
0      Jason    Miller   42
1      Molly  Jacobson   52
2       Tina       Ali   36
3       Jake    Milner   24
4        Amy     Cooze   73

In [5]:
df_people_2 = df_people.set_index((df_people.index + 1) * 100)

df_people_2

    first_name last_name  age
100      Jason    Miller   42
200      Molly  Jacobson   52
300       Tina       Ali   36
400       Jake    Milner   24
500        Amy     Cooze   73

In [6]:
try:
    pdutils.pd_content_in_columns_is_identical(df_people, df_people_2, df_people.columns)
except ValueError as e:
    print(type(e), e)

<class 'ValueError'> Can only compare identically-labeled DataFrame objects

In [7]:
pdutils.pd_col_is_identical_no_index(df_people, df_people_2, 'last_name')

True

In [8]:
for idx, row in df_people.iterrows():
    
    print(idx, '{} {}'.format(row['first_name'], row['last_name']))

0 Jason Miller
1 Molly Jacobson
2 Tina Ali
3 Jake Milner
4 Amy Cooze